Prathmesh07123/MiniProject-Sem5-STM32-BareMetal/Week_5/Day_9_(8-8-25)/Target/LoRa_SPI/Src/main.c

#include <stdio.h>
#include <stdint.h>
#include <stm32l4xx.h>

void LoRa_GPIO_Init(void);
void SPI1_Init(void);
void LoRa_SS_LOW(void);
void LoRa_SS_High(void);
uint8_t SPI_Tranfer(uint8_t data);
uint8_t LoRa_ReadReg(uint8_t add);
void LoRa_WriteReg(uint8_t add, uint8_t val);
void LoRa_Reset(void);

void clock_init(void){

	RCC->CR |= (1 << 8);

	while(!(RCC->CR & (1 << 10)));

	FLASH->ACR |= (4 << 0);
	FLASH->ACR |= (1 << 8);
	FLASH->ACR |= (1 << 9);
	FLASH->ACR |= (1 << 10);


	RCC->PLLCFGR = 0;
	RCC->PLLCFGR |= (0b10 << 0);
	RCC->PLLCFGR |= (0x1 << 4);
	RCC->PLLCFGR |= (18 << 8);
	RCC->PLLCFGR |= (0b00 << 25);
	RCC->PLLCFGR |= (1 << 24);

	RCC->CR |= (1 << 24);
	while(!(RCC->CR & (1 << 25)));

	RCC->CFGR &= ~(0b11 << 0);
	RCC->CFGR |= (0b11 << 0);
	while((RCC->CFGR & (0b11 << 2)) != (0b11 << 2));

	RCC->CFGR &= ~(0xF << 4);
	RCC->CFGR &= ~(0b111 << 8);
	RCC->CFGR &= ~(0b111 << 11);

}

void Systick_delay_ms(int delay){

	SysTick->LOAD = 71999;

	SysTick->VAL = 0;

	SysTick->CTRL |= (1 << 2);
	SysTick->CTRL |= (1 << 0);

	for(int i = 0; i < delay; i++){
		while(!(SysTick->CTRL & (1 << 16)));
	}

}

void LoRa_SS_LOW(void){
	GPIOA->ODR &= ~(1 << 3);
}

void LoRa_SS_High(void){
	GPIOA->ODR |= (1 << 3);
}

void LoRa_Reset(void){
	LoRa_SS_High();
	GPIOC->ODR &= ~(1 << 5);
	Systick_delay_ms(5);
	GPIOC->ODR |= (1 << 5);
	Systick_delay_ms(10);
}

void LoRa_GPIO_Init(void){

	RCC->AHB2ENR |= (1 << 0);
	RCC->AHB2ENR |= (1 << 2);


	//SPI1 SS PA3
	GPIOA->MODER &= ~(0b11 << 6);
	GPIOA->MODER |= (0b01 << 6);
	GPIOA->OSPEEDR |= (0b11 << 6);
	GPIOA->ODR |= (1 << 3);

	//SPI1 SCK PA5
	GPIOA->MODER &= ~(0b11 << 10);
	GPIOA->MODER |= (0b10 << 10);
	GPIOA->AFR[0] &= ~(0xF << 20);
	GPIOA->AFR[0] |= (0x5 << 20);
	GPIOA->OSPEEDR |= (0b11 << 10);

	//SPI1 MISO PA6
	GPIOA->MODER &= ~(0b11 << 12);
	GPIOA->MODER |= (0b10 << 12);
	GPIOA->AFR[0] &= ~(0xF << 24);
	GPIOA->AFR[0] |= (0x5 << 24);
	GPIOA->OSPEEDR |= (0b11 << 12);

	//SPI1 MOSI PA7
	GPIOA->MODER &= ~(0b11 << 14);
	GPIOA->MODER |= (0b10 << 14);
	GPIOA->AFR[0] &= ~(0xF << 28);
	GPIOA->AFR[0] |= (0x5 << 28);
	GPIOA->OSPEEDR |= (0b11 << 14);

	//LoRa Reset Pin PC5
	GPIOC->MODER &= ~(0b11 << 10);
	GPIOC->MODER |= (0b01 << 10);
	GPIOC->ODR |= (1 << 5);

	//LoRa DIO0 Pin PC4 IP
	GPIOC->MODER &= ~(0b11 << 8);

}

void SPI1_Init(void){

	RCC->APB2ENR |= (1 << 12);
	// fclk = 72MHz
	// Fclk/4 == 9MHz
	SPI1->CR1 &= ~(0b111 << 3);
	SPI1->CR1 |= (0b010 << 3);

	// CPOL = 0 , CPHA = 0
	SPI1->CR1 &= ~(0b11 << 0);

	// Full Duplex
	SPI1->CR1 &= ~(1 << 10);

	// Master Configuration
	SPI1->CR1 |= (1 << 2);

	// MSB First
	SPI1->CR1 &= ~(1 << 7);

	// 8bit Data Formet
	SPI1->CR2 &= ~(0xF << 8);
	SPI1->CR2 |= (0x7 << 8);

	//Software slave
	SPI1->CR1 |= (1 << 8);
	SPI1->CR1 |= (1 << 9);

	//Enable SPI
	SPI1->CR1 |= (1 << 6);


}

uint8_t SPI_Tranfer(uint8_t data){

	while(!(SPI1->SR & (1 << 1)));
	SPI1->DR = data;
	while(!(SPI1->SR & (1 << 0)));
	return (uint8_t)SPI1->DR;
}

uint8_t LoRa_ReadReg(uint8_t add){

	uint8_t val;
	LoRa_SS_LOW();
	SPI_Tranfer(add & 0x7F);
	val = SPI_Tranfer(0x00);
	LoRa_SS_High();
	return val;
}

void LoRa_WriteReg(uint8_t add, uint8_t val){
	LoRa_SS_LOW();
	SPI_Tranfer(add | 0x80);
	SPI_Tranfer(val);
	LoRa_SS_High();
}

int LoRa_Bringup(void){

	LoRa_Reset();
	uint8_t version = LoRa_ReadReg(0x06);

	if(version != 0x12){
		printf("Error in Getting LoRa Version!!!");
		fflush(stdout);
		return -1;

	}

	LoRa_WriteReg(0x01, 0x00);
	LoRa_WriteReg(0x01, 0x80);
	LoRa_WriteReg(0x06, 0x6C);
	LoRa_WriteReg(0x07, 0x80);
	LoRa_WriteReg(0x08, 0x00);

	return 0;
}



int main(void)
{
	clock_init();
	LoRa_GPIO_Init();
	SPI1_Init();
	LoRa_Reset();

	if(LoRa_Bringup() == 0){
		while(1){
			printf("LoRa Is Ready!!");
			fflush(stdout);
			Systick_delay_ms(1000);
		}
	}
	else{
		while(1){
			printf("Problem in Interfacing of LoRa!!!!!");
			fflush(stdout);
			Systick_delay_ms(1000);
		}
	}
}
